embedded-iot/STM32F0/Project/USER/MyLib/Delay/user_delay.c
/**
  ******************************************************************************
  * Ten Tep		:		    user_delay.c
  * Tac Gia		:	  		Nguyen Quy Nhat
  * Cong Ty		:			MinhHaGroup
  * Website 	:			MinhHaGroup.com
  * Phien Ban	:			V1.0.0
  * Ngay		:    		31-07-2012
  * Tom Tat   	:       	Dinh nghia cac ham su dung de tao tre.
  *             			
  *           
  *
  ******************************************************************************
  * Chu Y			:				
  *
  *
  * 
  ******************************************************************************
  */
#include "user_delay.h"
 #include "stm32f0xx.h"
 
static uint8_t  fac_us=0;
static uint16_t fac_ms=0;
void delay_init(uint8_t SYSCLK)
{
	SysTick->CTRL&=0xfffffffb;
	fac_us=SYSCLK/8;		    
	fac_ms=(uint16_t)fac_us*1000;
}								    
void delay_ms(uint16_t nms)
{	 		  	  
	uint32_t temp;		   
	SysTick->LOAD=(uint32_t)nms*fac_ms;
	SysTick->VAL =0x00;           
	SysTick->CTRL=0x01;         
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16))); 
	SysTick->CTRL=0x00;       
	SysTick->VAL =0X00;       	    
}   	    								   
void delay_us(uint32_t nus)
{		
	uint32_t temp;	    	 
	SysTick->LOAD=nus*fac_us;   		 
	SysTick->VAL=0x00;        
	SysTick->CTRL=0x01 ;      	 
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));   
	SysTick->CTRL=0x00;       
	SysTick->VAL =0X00;        
}


void initIWDG(uint8_t prer, uint16_t rlr) {
	IWDG->KR = 0X5555;							
  	IWDG->PR = prer;  							
  	IWDG->RLR = rlr;  							
	IWDG->KR = 0XAAAA;							
  	IWDG->KR = 0XCCCC;						
}

void IWDG_Feed(void) 
 {
   IWDG->KR=0XAAAA;
 }

































